# EA_UValueText

## Description
Returns U-Value or R-Value text depending on document settings.

```pascal
FUNCTION EA_UValueText(UValue : BOOLEAN): STRING;
```

```python
def vs.EA_UValueText(UValue):
    return STRING
```

## Parameters
|Name|Type|Description|
|---|---|---|
|UValue|BOOLEAN|   |

## Version
Availability: from Vectorworks 2016

## Category
* EnergyAnalysis Interface Library